import openpyxl

# 创建工作薄对象
wb = openpyxl.Workbook()

# 获取工作薄
sheet = wb.active

# 获取指定的单元格
cell = sheet['A1']

# 向单元格中添加数据
cell.value = '中'

# 一次写入一行数据
data_list = ['姓名', '年龄', '成绩']
sheet.append(data_list)

# 一次写入多行数据
data_list_1 = [
    ['ji', 23, 3455],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56],
    ['u', 45, 56]
]
for i in data_list_1:
    sheet.append(i)

# 保存
wb.save('我的工作薄.xlsx')
